console.log(` Самооценка: 85/85 \n
Смена изображений в секции portfolio +25 \n
при кликах по кнопкам Winter, Spring, Summer, Autumn в секции portfolio отображаются изображения из папки с соответствующим названием +20 \n
кнопка, по которой кликнули, становится активной т.е. выделяется стилем. Другие кнопки при этом будут неактивными +5 \n
Перевод страницы на два языка +25 \n
при клике по надписи ru англоязычная страница переводится на русский язык +10 \n
при клике по надписи en русскоязычная страница переводится на английский язык +10 \n
надписи en или ru, соответствующие текущему языку страницы, становятся активными т.е. выделяются стилем +5 \n
Переключение светлой и тёмной темы +25 \n
Выбран первый вариант макета. \n
На страницу добавлен переключатель при клике по которому: \n
тёмная тема приложения сменяется светлой +10 \n
светлая тема приложения сменяется тёмной +10 \n
после смены светлой и тёмной темы интерактивные элементы по-прежнему изменяют внешний вид при наведении и клике и при этом остаются видимыми на странице (нет ситуации с белым шрифтом на белом фоне) +5 \n
Дополнительный функционал: выбранный пользователем язык отображения страницы и светлая или тёмная тема сохраняются при перезагрузке страницы +5 \n
Дополнительный функционал: сложные эффекты для кнопок при наведении и/или клике +5 \n
`)